//=============================================================================
//
// ボスアニメーション構造体 [Struct_Boss.h]
//
//=============================================================================

#pragma once

// 爆発アニメーションテーブル
struct AnimTable_Explosion_C_Boss
{
	int no;		// QuadUV テーブル番号	
	int cnt;		// 表示ループ数
};

//爆発ＵＶ座標
struct QuadUV_Explosion_C_Boss
{
	float u[4];
	float v[4];
};


// 爆発UVテーブル (構造体QuadUV型の配列g_uvTable)
QuadUV_Explosion_C_Boss  g_uvTable_Explosion_Boss[17] =
{
	//一枚目
	{ 0.0f,			1.0f / 8.0f,	0.0f,			1.0f / 8.0f ,				// U値
	0.0f,			0.0f,			1.0f / 4.0f,	1.0f / 4.0f },				// V値

																				//二枚目
	{ 1.0f / 8.0f,	2.0f / 8.0f,	1.0f / 8.0f,	2.0f / 8.0f ,
	0.0f,			0.0f,			1.0f / 4.0f,	1.0f / 4.0f },

	//三枚目
	{ 2.0f / 8.0f,	3.0f / 8.0f,	2.0f / 8.0f,	3.0f / 8.0f ,
	0.0f,			0.0f,			1.0f / 4.0f,	1.0f / 4.0f },

	//四枚目
	{ 3.0f / 8.0f,	4.0f / 8.0f,	3.0f / 8.0f,	4.0f / 8.0f ,
	0.0f,			0.0f,			1.0f / 4.0f,	1.0f / 4.0f },

	//五枚目
	{ 4.0f / 8.0f,	5.0f / 8.0f,	4.0f / 8.0f,	5.0f / 8.0f ,
	0.0f,	   0.0f,	   1.0f / 4.0f,	    1.0f / 4.0f },

	//六枚目
	{ 5.0f / 8.0f,	6.0f / 8.0f,	5.0f / 8.0f,	6.0f / 8.0f ,
	0.0f,	0.0f,	1.0f / 4.0f,	1.0f / 4.0f },

	//七枚目
	{ 6.0f / 8.0f,	7.0f / 8.0f,	6.0f / 8.0f,	7.0f / 8.0f ,
	0.0f,	0.0f,	1.0f / 4.0f,	1.0f / 4.0f },

	//八枚目
	{ 7.0f / 8.0f,	8.0f / 8.0f,	7.0f / 8.0f,	8.0f / 8.0f ,
	0.0f,	0.0f,	1.0f / 4.0f,	1.0f / 4.0f },

	//九枚目
	{ 0.0f / 8.0f,	1.0f / 8.0f,	0.0f / 8.0f,	1.0f / 8.0f ,
	1.0f / 4.0f,	    1.0f / 4.0f,	2.0f / 4.0f,	2.0f / 4.0f },

	//十枚目
	{ 1.0f / 8.0f,	2.0f / 8.0f,	1.0f / 8.0f,	2.0f / 8.0f ,
	1.0f / 4.0f,  1.0f / 4.0f,	2.0f / 4.0f,	2.0f / 4.0f },

	//十一枚目
	{ 2.0f / 8.0f,	3.0f / 8.0f,	2.0f / 8.0f,	3.0f / 8.0f ,
	1.0f / 4.0f,  1.0f / 4.0f,	2.0f / 4.0f,	2.0f / 4.0f },

	//十二枚目
	{ 3.0f / 8.0f,	4.0f / 8.0f,	3.0f / 8.0f,	4.0f / 8.0f ,
	1.0f / 4.0f,	1.0f / 4.0f,	2.0f / 4.0f,	2.0f / 4.0f },

	//十三枚目
	{ 4.0f / 8.0f,	5.0f / 8.0f,	4.0f / 8.0f,	5.0f / 8.0f ,
	1.0f / 4.0f,	    1.0f / 4.0f,	2.0f / 4.0f,	2.0f / 4.0f },

	//十四目
	{ 5.0f / 8.0f,	6.0f / 8.0f,	5.0f / 8.0f,	6.0f / 8.0f ,
	1.0f / 4.0f,      1.0f / 4.0f,	2.0f / 4.0f,	2.0f / 4.0f },

	//十五枚目
	{ 6.0f / 8.0f,	7.0f / 8.0f,	6.0f / 8.0f,	7.0f / 8.0f ,
	1.0f / 4.0f,      1.0f / 4.0f,	2.0f / 4.0f,	2.0f / 4.0f },

	//十六枚目(16と17は同じ)
	{ 7.0f / 8.0f,	8.0f / 8.0f,	7.0f / 8.0f,	8.0f / 8.0f ,
	1.0f / 4.0f,	    1.0f / 4.0f,	2.0f / 4.0f,	2.0f / 4.0f },
	//十七枚目
	{ 7.0f / 8.0f,	8.0f / 8.0f,	7.0f / 8.0f,	8.0f / 8.0f ,
	1.0f / 4.0f,	    1.0f / 4.0f,	2.0f / 4.0f,	2.0f / 4.0f }
};


//爆発アニメーションテーブル
AnimTable_Explosion_C_Boss g_anim_Explosion_Boss[] =
{
	{ 0,10 },   //一枚目
	{ 1,10 },   //二枚目
	{ 2,10 },   //三枚目
	{ 3,10 },   //四枚目
	{ 4,10 },   //五枚目
	{ 5,10 },   //六枚目
	{ 6,10 },   //七枚目
	{ 7,10 },   //八枚目
	{ 8,10 },   //九枚目
	{ 9,10 },   //十枚目
	{ 10,10 },  //十一枚目
	{ 11,10 },  //十二枚目
	{ 12,10 },  //十三枚目
	{ 13,10 },  //十四枚目
	{ 14,10 },  //十五枚目
	{ 15,10 },  //十六枚目
	{ 16,10 },  //十六枚目
	{ -1,-1 }
};